[
    " Mina Was a Ballet Dancer for 11 Years: Before becoming an idol, Mina trained in ballet from a young age, showcasing her graceful movements in many of TWICE's performances.",
    "Jihyo Trained for 10 Years: Jihyo holds the longest training period in TWICE, having trained for a full decade before debuting.",
    "Chaeyoung’s Love for Food: Chaeyoung has a sweet tooth and is particularly fond of strawberries and other fruits, often indulging in them as her comfort food.",
    "Tzuyu’s Special Dance Background: Tzuyu studied modern dance before joining TWICE, contributing to her graceful and fluid movements on stage.",
    "Sana Almost Debuted in a Japanese Girl Group: Sana was scouted by other entertainment companies in Japan before joining JYP, where she decided to pursue a K-pop career.",
    "Jeongyeon’erfectionist, often practicing choreography and vocals for longer hours to ensure she gets every detail right.s Father is a Famous Chef: Jeongyeon’s father, Yoo Chang-joon, is a well-known traditional Korean chef who has even cooked for former South Korean presidents.",
    "Nayeon’s Bunny Teeth: Nayeon’s signature 'bunny teeth' are a defining feature that fans adore, and she often plays into her “bunny” persona.",
    "Momo Was Eliminated from Sixteen but Brought Back: Momo was eliminated during the survival show Sixteen, but JYP brought her back because of her impressive dancing skills.",
    "Dahyun’s Stage Fright: Despite her confident persona on stage, Dahyun has admitted that she used to suffer from stage fright before debuting with TWICE.",
    "Chaeyoung Doesn’t Like to Be Called Cute: Despite her small stature and youthful appearance, Chaeyoung prefers to be recognized for her charisma and talents rather than her cuteness.",
    "Tzuyu Was Class President in School: Before becoming an idol, Tzuyu served as the class president in her school, known for her leadership skills and popularity.",
    "Jihyo Was Once Sick of the Color Red: During their “Like OOH-AHH” era, Jihyo was given red outfits and accessories so often that she grew tired of the color for a while.",
    "Sana Learns Languages Quickly: Sana is known for her ability to pick up new languages quickly, which is evident in her fluency in both Korean and Japanese, and her growing English proficiency.",
    "Mina Once Took a Break for Her Mental Health: Mina took a hiatus in 2019 due to anxiety issues, receiving widespread support from fans for prioritizing her well-being.",
    "Jeongyeon’s Hairstyle Change: Jeongyeon used to sport short hair, which became her signature look early in TWICE’s career. She grew her hair out later on, surprising fans with her versatile looks.",
    "Nayeon is Left-Handed: Nayeon is one of the few K-pop idols who are left-handed, something fans have noticed during fan signs and variety shows.",
    "Momo’s Passion for Cleaning: Momo is the cleanest member of TWICE and has even earned the title of the “cleaning fairy” because of her love for tidying up their dorm.",
    "Chaeyoung’s First Rap Was in Elementary School: Chaeyoung performed her first rap during a talent show in elementary school, surprising her teachers and classmates with her skills.",
    "Jihyo Is Allergic to Pineapple: Despite loving various fruits, Jihyo is allergic to pineapples, which causes her to avoid them at all costs.",
    "Tzuyu Was the Last Member Added to TWICE: Even though she was a fan favorite on Sixteen, Tzuyu wasn’t originally part of the final line-up but was later added due to popular demand.",
    "Sana Has a 4D Personality: Sana is known for her “4D” (quirky) personality, often showing unexpected reactions and behaviors that endear her to fans.",
    "Jeongyeon Can Play the Guitar: In addition to her vocal talents, Jeongyeon can play the guitar and has shown off her skills in various behind-the-scenes content.",
    "Mina Loves Horror Movies: While some of her fellow members are scared of horror films, Mina enjoys watching them and is a fan of the genre.",
    "Dahyun Was Scouted by SM and JYP: Dahyun was scouted by both SM and JYP Entertainment after her “Eagle Dance” went viral, but she chose JYP to pursue her dream.",
    "Momo's Eating Habits Shock Fans: Despite her petite frame, Momo is known for having a huge appetite and can eat large portions, particularly when it comes to meat.",
    "Nayeon’s Dream Before Becoming an Idol: Nayeon originally wanted to be a flight attendant before deciding to pursue a career in K-pop.",
    "Chaeyoung is the Shortest Member of TWICE: Chaeyoung is the shortest member of TWICE, standing at 159 cm, though she has a big stage presence.",
    "Jihyo’s Real Name is Park Jisoo: Before officially debuting, Jihyo changed her stage name from Jisoo to Jihyo.",
    "Tzuyu’s Childhood Dream: Tzuyu’s original dream was to become a dermatologist before her interest in music led her down the path to becoming a K-pop star.",
    "Jeongyeon Once Had a Job at a Bakery: Before her debut, Jeongyeon briefly worked at a bakery where she learned basic baking skills.",
    "Mina’s Mother is an Influencer: Mina’s mother has gained attention for her elegant appearance and has a following of her own on social media.",
    "Sana Can Play the Piano: Sana took piano lessons during her childhood and can still play the instrument.",
    "Momo Has a Black Belt in Judo: Momo trained in Judo as a child and holds a black belt, a fact not widely known by many fans.",
    "Nayeon’s First Audition Was at Age 10: Nayeon auditioned for JYP Entertainment when she was just 10 years old but wasn’t allowed to join until she was older.",
    "Dahyun’s Skin is Sensitive: Dahyun has extremely sensitive skin and is very careful about the makeup and skincare products she uses.",
    "Mina Enjoys Fishing: Mina once revealed that she enjoys fishing and finds it a relaxing hobby when she has free time.",
    "Jihyo is a Big Fan of IU: Jihyo has mentioned that she is a huge fan of solo artist IU and looks up to her as a role model.",
    "Chaeyoung Draws on Everything: Chaeyoung often doodles on anything she can get her hands on, including her phone case, notebooks, and even her members’ belongings.",
    "Tzuyu Prefers Casual Outfits: Despite her glamorous image, Tzuyu has revealed that she prefers wearing comfortable, casual clothing in her everyday life.",
    "Momo’s Nickname is “Momoring”: Fans and her fellow members often call Momo “Momoring” as a cute nickname.",
    "Sana’s Cheerful Personality: Sana is known as the most optimistic member of TWICE, always spreading positivity and lifting the mood of those around her.",
    "Jeongyeon Is Ambidextrous: Jeongyeon is one of the few ambidextrous K-pop idols, able to use both hands for tasks like writing and eating.",
    "Mina is the Quietest Member: While all the members are close, Mina is known to be the most reserved and quiet, especially when compared to her more talkative bandmates.",
    "Dahyun is Good at Lip Syncing: Dahyun is particularly good at lip-syncing and mimicking others’ voices, a talent she often showcases on variety shows.",
    "Jihyo’s Mother Supported Her Dream Early: Jihyo’s mother was incredibly supportive of her dream to become an idol and helped her audition for JYP at the age of 8.",
    "Chaeyoung’s Penmanship is Artistic: Chaeyoung has beautifully artistic penmanship, which reflects her natural creative talents.",
    "Tzuyu is Friends with (G)I-DLE’s Shuhua: Tzuyu has a close friendship with Shuhua from (G)I-DLE, as both are Taiwanese and have bonded over their shared background.",
    "Momo’s Role in Dance: Momo often takes the lead when it comes to teaching TWICE choreography, as her dance skills are the sharpest among the members.",
    "Sana Learned Korean from K-dramas: Before coming to Korea, Sana began learning Korean by watching Korean dramas and variety shows.",
    "Nayeon Once Had Braces: Before debuting, Nayeon had braces to help perfect her smile.",
    "Jeongyeon is Afraid of Bugs: Despite her tough exterior, Jeongyeon has a fear of bugs and often jumps at the sight of insects.",
    "Mina Used to Live in Texas: Mina spent part of her childhood living in Texas, USA, before moving back to Japan and later joining JYP.",
    "Dahyun Loves Spicy Food: Dahyun is known to have a high tolerance for spicy food, often surprising her members with how much spice she can handle.",
    "Jihyo’s Leadership Was Developed Early: Jihyo’s leadership skills were honed during her training years, where she often took on the role of helping and guiding younger trainees.",
    "Chaeyoung Has a Dragon Tattoo: Chaeyoung has a small tattoo of a dragon on her arm, showcasing her bold and artistic personality.",
    "Tzuyu Has a Strong Sense of Justice: Tzuyu has always been outspoken about fairness and justice, even during her trainee years.",
    "Momo Once Slept Through an Earthquake: Momo once revealed that she slept through an earthquake during one of TWICE's trips, much to the amusement of her members.",
    "Sana is Left-Handed When Eating: Sana primarily uses her left hand to eat, even though she is right-handed for most other activities.",
    "Jeongyeon’s Love for Tteokbokki: Jeongyeon’s favorite food is tteokbokki, a popular Korean street food dish made of spicy rice cakes.",
    "Dahyun’s Stage Name Almost Was “Cherry”: Early on, Dahyun was considering using “Cherry” as her stage name before sticking with her real name.",
    "Jihyo is a Night Owl: Jihyo often stays up late and considers herself more productive during nighttime hours.",
    "Chaeyoung’s Brother is a Model: Chaeyoung’s brother, Jeong Hun, is a fashion model, and fans have noted their striking resemblance.",
    "Tzuyu’s Favorite Animal is a Dog: Tzuyu loves dogs and has a pet dog named Gucci, who frequently appears in her photos.",
    "Momo Once Broke Her Finger: Momo once broke her finger during practice but continued to work hard despite the injury, showing her dedication to the group.",
    "Sana’s Laugh is Contagious: Sana has a unique, infectious laugh that often makes her fellow members and fans burst into laughter with her.",
    "Jeongyeon’s Bond with GOT7’s Jinyoung: Jeongyeon has a close friendship with GOT7’s Jinyoung, as the two were trainees together for many years.",
    "Mina’s Stage Name Almost Was Sharon: During pre-debut days, Mina considered using the stage name “Sharon” to reflect her Japanese and American background.",
    "Dahyun’s Nickname is “Tofu”: Dahyun is often called “Tofu” by her members and fans because of her fair, porcelain-like skin.",
    "Jihyo Was Originally a Backup Dancer: Before debuting with TWICE, Jihyo appeared as a backup dancer in music videos for other JYP artists like Miss A.",
    "Chaeyoung Loves Vintage Fashion: Chaeyoung is known for her unique sense of style and loves vintage fashion, often sporting retro looks in her daily outfits.",
    "Tzuyu Likes to Cook: Tzuyu has a growing interest in cooking and enjoys making simple dishes for herself and her members.",
    "Momo Was Almost a Solo Artist: JYP Entertainment considered debuting Momo as a solo artist before deciding she was a better fit for a group dynamic.",
    "Sana Once Had an Accent in Korean: When Sana first started learning Korean, she had a noticeable Japanese accent, which has since faded with her fluency in the language.",
    "Jeongyeon Used to be a Shy Trainee: Despite her bold personality now, Jeongyeon was shy and reserved during her early trainee days at JYP Entertainment.",
    "Mina’s Korean Name is Myoui Sharon: Though Mina is Japanese, her Korean name is Myoui Sharon, which she adopted after moving to South Korea.",
    "Dahyun’s Favorite Color is White: Dahyun has mentioned multiple times that her favorite color is white, symbolizing purity and simplicity.",
    "Jihyo’s Childhood Nickname Was “Mic Girl”: As a child, Jihyo would carry a toy microphone around and sing all the time, earning her the nickname 'Mic Girl.'",
    "Chaeyoung Dislikes Carbonated Drinks: While her members enjoy soda, Chaeyoung doesn’t like the fizzy sensation of carbonated drinks.",
    "Tzuyu Prefers the Beach to the Mountains: Tzuyu loves the beach and finds it calming, often choosing it as her ideal vacation spot.",
    "Momo is a Big Fan of Beyoncé: Momo has cited Beyoncé as one of her biggest inspirations when it comes to dancing and performing on stage.",
    "Sana Struggles with Directions: Sana has admitted that she has a poor sense of direction and often gets lost even in familiar places.",
    "Jeongyeon Had Back Problems: Jeongyeon took a brief hiatus from TWICE’s promotions in 2020 due to a herniated disc in her neck, which required treatment and rest.",
    "Mina Loves Corgis: Mina’s favorite dog breed is the corgi, and she’s mentioned wanting to adopt one in the future.",
    "Dahyun Writes in Her Journal Daily: Dahyun keeps a daily journal where she writes down her thoughts and experiences, using it as a form of self-expression.",
    "Jihyo is the Strongest Member: Despite her smaller size, Jihyo is often considered the physically strongest member of TWICE, capable of lifting and carrying her fellow members.",
    "Chaeyoung Collects Lip Balms: Chaeyoung has a habit of collecting different flavors and brands of lip balm and often carries multiple in her bag.",
    "Tzuyu Was Bullied for Her Height: During her school days, Tzuyu was often teased for her height, but she now embraces it as one of her standout features.",
    "Momo Practices for Hours in Front of a Mirror: Momo is known for spending hours practicing dance in front of a mirror to perfect every move.",
    "Sana Likes to Nap Between Schedules: Whenever there’s a short break in TWICE’s busy schedule, Sana loves to sneak in a quick nap, even if it’s just for a few minutes.",
    "  Dahyun’s Eagle Dance Origin: Dahyun became famous for her “Eagle Dance” during her pre-debut days, which she performed at a church event before going viral.",
    "Jihyo’s Role as an Actress: Before TWICE's debut, Jihyo was offered several acting roles in dramas. However, she chose to focus on her singing career.",
    "Tzuyu's Family Owns a Medical Aesthetic Clinic: Tzuyu’s family runs a medical aesthetic clinic in her hometown, Tainan, Taiwan.",
    "Chaeyoung’s Hidden Artistic Talent: Chaeyoung has a deep passion for art and often designs covers and artwork for TWICE’s albums and merchandise.",
    "Nayeon Almost Debuted in Another Group: Nayeon was originally set to debut in a different JYP girl group before TWICE was formed but was placed in the survival show Sixteen instead.",
    "Jeongyeon’s Stage Name: Jeongyeon originally went by her real name, Yoo Kyungwan, but changed it before debuting to avoid confusion with a South Korean actor of the same name.",
    "Mina Was Scouted in a Shopping Mall: Mina was discovered by a JYP scout while she was shopping with her mother in Osaka, Japan, and invited to audition.",
    "Sana Was Almost a K-pop Actress: Sana initially trained to be an actress before switching her focus to becoming an idol under JYP.",
    "Momo’s Love for Meat Earned Her a Nickname: Momo is known as the “meat queen” because of her love for meat dishes, and her members frequently mention her passion for food.",
    "TWICE’s Hidden Message in “TT” MV: In the music video for “TT,” there are various subtle references to their past songs and even nods to other K-pop artists like Miss A and GOT7, all JYP Entertainment groups."
]